#Использовать asserts
#Использовать json
#Использовать "../src"

// -------------------- Примеры текучие утверждения ---------//
	
	//Ожидаем.Что(1 > 0).ЭтоИстина();
	//Ожидаем.Что(13 = 2).Не_().ЭтоИстина();
	//Ожидаем.Что(5 = 7).ЭтоЛожь();
	//Ожидаем.Что(5).Равно(5);
	//Ожидаем.Что(4).Больше(2);
	//Ожидаем.Что(7).БольшеИлиРавно(7);
	//Ожидаем.Что(НекийМассив.Количество()).Минимум(9);
	//Ожидаем.Что(90).МеньшеИлиРавно(100);
	//Ожидаем.Что(СтрДлина(НекаяСтрока)).Максимум(90);
	//Ожидаем.Что(55).Меньше(56);
	//Ожидаем.Что(1).Заполнено();
	//Ожидаем.Что(Новый Массив).Существует();
	//Ожидаем.Что(Неопределено).ЭтоНеопределено();
	//Ожидаем.Что(ВыборкаИзБД.НекоеПоле).ЭтоNull();
	//Ожидаем.Что("").ИмеетТип("Строка");
	//Ожидаем.Что(7).Между(1, 10);
	//Ожидаем.Что("Некая строка").Содержит("стр");
	//Ожидаем.Что("Некая строка").ИмеетДлину(12);   	
	//Ожидаем.Что("Некая строка")
	//	.Существует()
	//	.Не_().ИмеетТип("Число")
	//	.ИмеетДлину(12)
	//	.Не_().Содержит("!!!");
	// -------------------- Конец текучие утверждения ---------//
	



Перем юТест;

Функция ПолучитьСписокТестов(Знач Тестирование) Экспорт
	
	юТест = Тестирование;
	
	ИменаТестов = Новый Массив;
	
	ИменаТестов.Добавить("ТестДолжен_ПроверитьИнициализациюКлассаПроблема");
	
	Возврат ИменаТестов;
	
КонецФункции

Процедура ТестДолжен_ПроверитьИнициализациюКлассаПроблема() Экспорт
	
	Проблема = Новый Проблема();
	Ожидаем.Что(ТипЗнч(Проблема) = Тип("Проблема")).Равно(Истина);	
	Ожидаем.Что(Проблема.key).ИмеетТип("Строка").Не_().Заполнено();
	Ожидаем.Что(Проблема.id).ИмеетТип("Строка").Не_().Заполнено();

КонецПроцедуры
